# 修改模型

# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [19,27,  44,40,  38,94]  # P3/8
  - [96,68,  86,152,  180,137]  # P4/16
  - [140,301,  303,264,  238,542]  # P5/32


backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, SPPF, [512, 5]],  # 7
  ]


head:
  [[-1, 1, Conv, [256, 1, 1]],                 # 减少上层特征通道
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 上采样将特征图扩大两倍
   [[-1, 4], 1, Concat, [1]],  # cat backbone P5，跟P5 合并此时通道为2倍768
   [-1, 3, C3, [256, False]],  # 11            # 降通道

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [128, False]],  # 15

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [64, False]],  # 19 

   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P2
   [-1, 3, C3, [128, False]],  # 22 

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P3
   [-1, 3, C3, [256, False]],  # 25 

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 28 (P4/16-medium)

   [[22, 25, 28], 1, Detect, [nc, anchors]],  # Detect(P2, P3)
  ]
